In [1]:
import pandas as pd

In [26]:
df=pd.read_csv('hari.csv',names=['a','b','c','d'])

In [28]:
df.head(10)

       a    b       c            d
0   Name  Age  Salary  Designation
1  Mohan   22   12000      Manager
2    Ram  NaN   10000          ASM
3   Hari  NaN     NaN          NaN
4   Raaz   22     NaN           DM
5  Lucky   20  800000           RM
6  Tarun   25   12000          NaN
7  Tarun   25   12000          NaN

In [30]:
df.dropna(thresh=2,inplace=True)

In [31]:
df.head()

       a    b       c            d
0   Name  Age  Salary  Designation
1  Mohan   22   12000      Manager
2    Ram  NaN   10000          ASM
4   Raaz   22     NaN           DM
5  Lucky   20  800000           RM

In [22]:
df.dropna(inplace=True)

In [23]:
df.head()

       a    b       c            d
0   Name  Age  Salary  Designation
1  Mohan   22   12000      Manager
5  Lucky   20  800000           RM

In [32]:
df.drop_duplicates()

       a    b       c            d
0   Name  Age  Salary  Designation
1  Mohan   22   12000      Manager
2    Ram  NaN   10000          ASM
4   Raaz   22     NaN           DM
5  Lucky   20  800000           RM
6  Tarun   25   12000          NaN

In [34]:
df.a

0     Name
1    Mohan
2      Ram
4     Raaz
5    Lucky
6    Tarun
7    Tarun
Name: a, dtype: object

In [38]:
df.iloc[:,1:3]

     b       c
0  Age  Salary
1   22   12000
2  NaN   10000
4   22     NaN
5   20  800000
6   25   12000
7   25   12000

In [41]:
df.loc[:,'a'] #index ,Name

0     Name
1    Mohan
2      Ram
4     Raaz
5    Lucky
6    Tarun
7    Tarun
Name: a, dtype: object